src/Catalogs/Ячейки/Ячейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Ячейки</name>
  <owners>Catalog.Склады</owners>
  <attributes>
    <name>ТипСкладскойЯчейки</name>
    <type>
      <types>EnumRef.ТипыСкладскихЯчеек</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкаСортировки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/ТипыСкладскихЯчеек/ТипыСкладскихЯчеек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСкладскихЯчеек</name>
  <enumValues>
    <name>Приемка</name>
  </enumValues>
  <enumValues>
    <name>Отгрузка</name>
  </enumValues>
  <enumValues>
    <name>Хранение</name>
  </enumValues>
  <enumValues>
    <name>Архив</name>
  </enumValues>
  <enumValues>
    <name>Курьер</name>
  </enumValues>
  <enumValues>
    <name>УпаковочныйСтол</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Ячейки/ManagerModule.bsl
Функция ПолучитьЯчейкиСортировки(Знач Склад = Неопределено) Экспорт	
	Если Склад = Неопределено Тогда
		Склад = Константы.ОсновнойСклад.Получить();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Ячейки.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Ячейки КАК Ячейки
		|ГДЕ
		|	Ячейки.ЯчейкаСортировки
		|	И Ячейки.Владелец = &Склад";
	
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МассивЯчейкиСортировки = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивЯчейкиСортировки.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;

	Возврат МассивЯчейкиСортировки;
КонецФункции

Функция ПолучитьЯчейкиПриемки(Знач Склад = Неопределено) Экспорт	
	Если Склад = Неопределено Тогда
		Склад = Константы.ОсновнойСклад.Получить();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Ячейки.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Ячейки КАК Ячейки
		|ГДЕ
		|	Ячейки.Владелец = &Склад
		|	И Ячейки.ТипСкладскойЯчейки = ЗНАЧЕНИЕ(Перечисление.ТипыСкладскихЯчеек.Приемка)";
	
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МассивЯчейкиПриемки = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивЯчейкиПриемки.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;

	Возврат МассивЯчейкиПриемки;
КонецФункции
